/** @jsx jsx*/

import React from "react";
import styled from "@emotion/styled";
import { colors, fonts } from "@src/vars";
import { jsx } from "@emotion/core";

const Root = styled.div`
background-color: ${colors.white};
//@media (max-width: 1280px) {}
//@media (max-width: 768px) {}
display: flex;
flex-direction: column;
align-items: center;

`

const Title = styled.h1`
${fonts.gotham_black_45_medium};
margin: 170px 0 95px 0 ;

@media (max-width: 1280px) {${fonts.gotham_black_32_medium};    margin: 75px 0 45px 0 ;}
@media (max-width: 768px) {    ${fonts.gotham_black_22_medium};    margin: 40px 0 45px 0 ;}
@media (max-width: 375px) {
}

`

const Items = styled.div`
display: flex;
`
const Item = styled.div`
position: relative;
`

const Icon = styled.div`
top: 0;
position: absolute;
z-index: 1;
`

const Text = styled.div`
background-color: transparent;
z-index: 2;
`

const HowItWorks = () => <Root>
    <Title>Как работает франшиза BattBox?</Title>
    <Items>
        <Item>
            <Icon><svg width="30" height="69" viewBox="0 0 30 69" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M29.9844 68.5H16.4375V16.2812L0.265625 21.2969V10.2812L28.5312 0.15625H29.9844V68.5Z" fill="#15E9E9"/></svg></Icon>
           <Text>
            Вы приобретаете станции<br/>
            с power bank в комплекте<br/>
            Устанавливаете их по всему городу<br/>
           </Text>

        </Item>
        <Item>
            <Text>
                Вы приобретаете станции<br/>
                с power bank в комплекте<br/>
                Устанавливаете их по всему городу<br/>
            </Text>
            <Icon><svg width="49" height="70" viewBox="0 0 49 70" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M48.8594 69.5H2.07812V60.2188L24.1562 36.6875C27.1875 33.375 29.4219 30.4844 30.8594 28.0156C32.3281 25.5469 33.0625 23.2031 33.0625 20.9844C33.0625 17.9531 32.2969 15.5781 30.7656 13.8594C29.2344 12.1094 27.0469 11.2344 24.2031 11.2344C21.1406 11.2344 18.7188 12.2969 16.9375 14.4219C15.1875 16.5156 14.3125 19.2812 14.3125 22.7188H0.71875C0.71875 18.5625 1.70312 14.7656 3.67188 11.3281C5.67188 7.89063 8.48438 5.20312 12.1094 3.26562C15.7344 1.29688 19.8438 0.3125 24.4375 0.3125C31.4688 0.3125 36.9219 2 40.7969 5.375C44.7031 8.75 46.6562 13.5156 46.6562 19.6719C46.6562 23.0469 45.7812 26.4844 44.0312 29.9844C42.2812 33.4844 39.2812 37.5625 35.0312 42.2188L19.5156 58.5781H48.8594V69.5Z" fill="#15E9E9"/></svg></Icon>
        </Item>
        <Item>
            <Text>
                Вы приобретаете станции<br/>
                с power bank в комплекте<br/>
                Устанавливаете их по всему городу<br/>
            </Text>
            <Icon><svg width="48" height="71" viewBox="0 0 48 71" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M15.8594 29.375H23.0781C26.5156 29.375 29.0625 28.5156 30.7188 26.7969C32.375 25.0781 33.2031 22.7969 33.2031 19.9531C33.2031 17.2031 32.375 15.0625 30.7188 13.5312C29.0938 12 26.8438 11.2344 23.9688 11.2344C21.375 11.2344 19.2031 11.9531 17.4531 13.3906C15.7031 14.7969 14.8281 16.6406 14.8281 18.9219H1.28125C1.28125 15.3594 2.23438 12.1719 4.14062 9.35938C6.07812 6.51562 8.76562 4.29688 12.2031 2.70312C15.6719 1.10938 19.4844 0.3125 23.6406 0.3125C30.8594 0.3125 36.5156 2.04688 40.6094 5.51562C44.7031 8.95312 46.75 13.7031 46.75 19.7656C46.75 22.8906 45.7969 25.7656 43.8906 28.3906C41.9844 31.0156 39.4844 33.0312 36.3906 34.4375C40.2344 35.8125 43.0938 37.875 44.9688 40.625C46.875 43.375 47.8281 46.625 47.8281 50.375C47.8281 56.4375 45.6094 61.2969 41.1719 64.9531C36.7656 68.6094 30.9219 70.4375 23.6406 70.4375C16.8281 70.4375 11.25 68.6406 6.90625 65.0469C2.59375 61.4531 0.4375 56.7031 0.4375 50.7969H13.9844C13.9844 53.3594 14.9375 55.4531 16.8438 57.0781C18.7812 58.7031 21.1562 59.5156 23.9688 59.5156C27.1875 59.5156 29.7031 58.6719 31.5156 56.9844C33.3594 55.2656 34.2812 53 34.2812 50.1875C34.2812 43.375 30.5312 39.9688 23.0312 39.9688H15.8594V29.375Z" fill="#15E9E9"/></svg></Icon>
        </Item>
    </Items>
</Root>

export default HowItWorks
